{"query": "my wrists hurt when i clean and jerk", "tests": "I'm here to help you figure out why your wrists hurt when you do a clean and jerk. Let's try to identify the root issue. Here are a few diagnostic tests I'd like you to try:\n\n1. **Wrist Extension Test**: This test will help us see if there's an issue with your wrist joint or the muscles around it. You'll need to press your palms together and try to extend your wrists as far as possible. If you come up short, it could indicate stiffness or short muscles in your forearms or limited wrist joint mobility.\n\n2. **Scapular Squeeze Test**: This test will help us evaluate the strength and stability of your shoulder muscles, specifically your scapular stabilizers. You'll need to sit or stand with your arms at your sides and squeeze your shoulder blades together. If you feel pain or weakness in your shoulders, it could be related to your wrist pain when doing a clean and jerk.\n\n3. **Thoracic Spine Mobility Test**: This test will help us evaluate the mobility of your thoracic spine, which is connected to your shoulder complex. You'll need to lie on your back with your knees bent and feet flat on the floor, then bring your arms up overhead and try to touch your hands to a wall or ceiling. If you feel pain or stiffness in your thoracic spine, it could be contributing to your wrist pain when doing a clean and jerk.", "test_results": "im not able to do wrist extentions", "response": "Based on the test results, you're unable to do wrist extensions due to wrist pain when cleaning and jerking. Here's a plan to address the issue:\n\n**Corrective Exercises:**\n\n1. **Wrist Extension Stretch:**\n\t* Hold a light weight (less than 1 lb) with your arm straight and palm down.\n\t* Slowly tilt your wrist up, keeping your forearm still.\n\t* Hold for 15-30 seconds and repeat 3-5 times.\n2. **Radial Tunnel Syndrome Test (modified):**\n\t* Hold a light weight with your arm straight and palm down.\n\t* Slowly tilt your wrist up, keeping your forearm still.\n\t* If you feel pain in your lateral elbow, stop and modify your technique.\n3. **Wrist Mobilization Drill:**\n\t* Place a barbell in a rack and throw your arm over the top (as described in the reference material).\n\t* Pull down on your arm as you slowly glide your triceps up and down the barbell.\n\t* Pause on areas of tenderness before moving your elbow up and down for a minute.\n\n**Mobility Drills:**\n\n1. **Wrist Extension Mobility:**\n\t* Hold a light weight with your arm straight and palm down.\n\t* Slowly tilt your wrist up, keeping your forearm still.\n\t* Focus on maintaining a neutral wrist alignment.\n2. **Forearm Rotator Stretch:**\n\t* Hold a light weight with your arm straight and palm down.\n\t* Slowly rotate your forearm, keeping your wrist still.\n\t* Hold for 15-30 seconds and repeat 3-5 times.\n\n**Activity Modifications:**\n\n1. **Adjust Your Grip:**\n\t* When cleaning and jerking, try to maintain a neutral wrist alignment.\n\t* Avoid fully extending your wrists, as this can put additional stress on your forearm extensor muscles.\n2. **Modify Your Technique:**\n\t* Keep your elbows slightly higher in the back squat position to reduce the need for full wrist extension.\n\t* Focus on maintaining a strong grip with a neutral wrist alignment.\n\n**Additional Tips:**\n\n1. **Gradually Progress Mobility Drills:**\n\t* Start with short sessions (5-10 minutes) and gradually increase duration and intensity.\n2. **Listen to Your Body:**\n\t* If you experience increased pain or discomfort, stop the exercise or modify the technique.\n\nRemember to consult with a healthcare professional or certified strength and conditioning specialist to ensure you're addressing the root cause of your wrist pain."}